/*Íàïèøèòå ïðîãðàììó, íàõîäÿùóþ êîðíè óðàâíåíèÿ
2018X +2019Y=78487894
ýôôåêòèâíûì ïåðåáîðîì. Â êîììåíòàðèÿõ íàïèøèòå, ïî÷åìó ïåðåáîð - ýôôåêòèâíûé*/
// ïåðåáîð ýôôåêòèâíûé òàê êàê ìû óìåíüøèëè åãî â 2018 ðàç

#include <iostream>

using namespace std;

int main()
{
    int x = 0, y = 0, n = 0, a = 78487894 / 2018;
    for (x; x < a; x++)
    {
        y = (78487894 - (x * 2018)) / 2019;
        n = (78487894 - (x * 2018)) % 2019;
        if (n == 0)
        {
        cout << "x = " << x << " ";
        cout << "y = " << y;

        }
    }
    return 0;
}
